#+title: A Brief Tutorial for org-mode
#+author: Huming.Chen
#+email: chenhuming@gmail.com

* Outline
  org-mode can do outline.
** Hotkeys
   <TAB>        => switch between FOLDED, CHILDREN and SUBTREE.
   <S-TAB>      => switch between OVERVIEW, CONTENTS and SHOW-ALL.
   <C-RETURN>   => insert new headings with same level as previous.
   <M-UP>       => move subtree up.
   <M-DOWN>     => move subtree down.
   <M-LEFT>     => promote heading.
   <M-RIGHT>    => demote heading.
   <S-M-LEFT>   => promote subtree.
   <S-M-RIGHT>  => demote subtree.
   <S-UP>       => increase priority of heading.
   <S-DOWN>     => decrease priority of heading.
   <C-c c>      => capture something, continue your work.

* Markup
  org-mode can do markup.
** Font styles
   * bold *           -> *bold*
   / italic /         -> /italic/
   = verbatim =       -> =verbatim=
   + strikethrough +  -> +strikethrough+
** Bulleted list items
   - bulleted
   - list
   - items
** Links
   [[https://orgmode.org][link-to-web: orgmode.org]]
   [[file:~/.emacs.d/elisp/init-org.el::;;; Code][link-to-file-position: init-org.el]]
*** Hotkeys
   <C-c C-l>  => insert all kinds of links.
   <C-c C-o>  => open thing at point.

* Todo
  org-mode can do GTD stuff.
** Sample todo lists
*** TODO explain todo lists
    DEADLINE: <2019-03-09 Sat>
*** DONE cycle through states
    CLOSED: [2019-03-02 Sat 19:40]
    :LOGBOOK:
    - State "DONE"       from "TODO"       [2019-03-02 Sat 19:36]
    :END:
** Hotkeys
   <S-M-RETURN>  => insert todo headings.
   <C-c C-t>     => change todo state.
   <C-c C-d>     => insert deadline for todo item.
   <C-c a>       => open org-agenda.
   <S-UP>        => modify timestampe.
   <S-DOWN>      => modify timestampe.
   <S-LEFT>      => modify timestampe.
   <S-RIGHT>     => modify timestampe.

* Tables
  org-mode can do tables
** Sample table
  |------+----------------|
  | Some | Data           |
  |------+----------------|
  |   12 | buckle my shoe |
  |------+----------------|
  |   34 | shut the door  |
  |------+----------------|
** Hotkeys
   <C-c |>      => create a table, or convert region into a table.
   <|>          => starts a row
   <|->         => starts a horizontal separator line
   <TAB>        => re-align the table
   <M-UP>       => move row up.
   <M-DOWN>     => move row down.
   <M-LEFT>     => move column lef.
   <M-RIGHT>    => move column right.
   <S-M-LEFT>   => delete column.
   <S-M-RIGHT>  => insert column.

* Export
  org-mode can export to HTML, LaTeX, PDF etc.
** Hotkeys
   <C-c C-e>  => org-export
** Meta-data for export
   #+title: A Brief Tutorial for org-mode
   #+options: toc:nil

* Source code
  org-mode can embed scripts and run them.
** Sample script
   #+begin_src ruby
   def fact(n)
     if n == 0
       1
     else
       n * fact(n-1)
     end
   end

   fact(5)
   #+end_src

   #+RESULTS:
   : 120
** Hotkeys
   <C-c C-c>  => evaluate script and place result afer #+RESULTS:

* LaTeX integration
  org-mode can do LaTeX.
** Sample LaTeX
   - Characters: \alpha \rightarrow \beta
   - $O(n \log n)$
